Changing the family for a MEP fitting might cause unexpected results.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId UnexpectedFamilyChangeResultsError { get; }
  Visual Basic
Public Shared ReadOnly Property UnexpectedFamilyChangeResultsError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ UnexpectedFamilyChangeResultsError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace